AZURE Load Tests/Plat/Profile_POST (multiple) New/Profile_POST.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="POST Profile" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Pro POST" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1387868917000</longProp>
        <longProp name="ThreadGroup.end_time">1387868917000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="Pro POST Authorization Manager" enabled="true">
          <collectionProp name="AuthManager.auth_list">
            <elementProp name="" elementType="Authorization">
              <stringProp name="Authorization.username">system</stringProp>
              <stringProp name="Authorization.password">#dR%ejF3RFm=</stringProp>
            </elementProp>
          </collectionProp>
          <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
        </AuthManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Pro  POST Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Pro POST Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pro POST Request 1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;profileId&quot;: 2299,&#xd;
  &quot;dateCreated&quot;: &quot;2012-04-05T15:42:39&quot;,&#xd;
  &quot;dateModified&quot;: &quot;2019-04-20T02:46:14&quot;,&#xd;
  &quot;externalKey&quot;: &quot;&quot;,&#xd;
  &quot;isActive&quot;: true,&#xd;
  &quot;prefix&quot;: &quot;Mr.&quot;,&#xd;
  &quot;suffix&quot;: &quot;&quot;,&#xd;
  &quot;firstName&quot;: &quot;Test pro fname&quot;,&#xd;
  &quot;middleName&quot;: &quot;&quot;,&#xd;
  &quot;lastName&quot;: &quot;Test pro lname&quot;,&#xd;
  &quot;badgeName&quot;: &quot;Test badge name&quot;,&#xd;
  &quot;position&quot;: &quot;Director&quot;,&#xd;
  &quot;organization&quot;: &quot;Certain&quot;,&#xd;
  &quot;phone&quot;: &quot;&quot;,&#xd;
  &quot;phone2&quot;: &quot;&quot;,&#xd;
  &quot;phoneMobile&quot;: &quot;&quot;,&#xd;
  &quot;fax&quot;: &quot;&quot;,&#xd;
  &quot;email&quot;: &quot;2E668680-727E-4441-85E0-CEEF505985C5@certain.com&quot;,&#xd;
  &quot;ccAssistantOnEmails&quot;: false,&#xd;
  &quot;ccAssociateOnEmails&quot;: false,&#xd;
  &quot;accountCode&quot;: &quot;reeduat&quot;,&#xd;
  &quot;profilePin&quot;: &quot;REEDUAT02299&quot;,&#xd;
  &quot;pkProfileId&quot;: &quot;0x439480001&quot;,&#xd;
  &quot;showOnline&quot;: true,&#xd;
  &quot;imported&quot;: false,&#xd;
  &quot;media&quot;: {&#xd;
    &quot;url&quot;: &quot;www.certain.com&quot;,&#xd;
    &quot;photo&quot;: null&#xd;
 }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">certainazure4.certain.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/certainExternal/service/v1/Profile/reeduat/REEDUAT02299</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Pro View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Pro Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Pro POSTSummary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pro POST Request 2" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;profileId&quot;: 2433,&#xd;
&quot;dateCreated&quot;: &quot;2012-04-16T03:31:22&quot;,&#xd;
&quot;dateModified&quot;: &quot;2019-01-02T06:03:56&quot;,&#xd;
&quot;externalKey&quot;: &quot;&quot;,&#xd;
&quot;isActive&quot;: true,&#xd;
&quot;prefix&quot;: &quot;&quot;,&#xd;
&quot;suffix&quot;: &quot;&quot;,&#xd;
&quot;firstName&quot;: &quot;Test pro fname&quot;,&#xd;
&quot;middleName&quot;: &quot;&quot;,&#xd;
&quot;lastName&quot;: &quot;Test pro lname&quot;,&#xd;
&quot;badgeName&quot;: &quot;Test badge name&quot;,&#xd;
&quot;position&quot;: &quot;g&quot;,&#xd;
&quot;organization&quot;: &quot;g&quot;,&#xd;
&quot;phone&quot;: &quot;&quot;,&#xd;
&quot;phone2&quot;: &quot;&quot;,&#xd;
&quot;phoneMobile&quot;: &quot;&quot;,&#xd;
&quot;fax&quot;: &quot;&quot;,&#xd;
&quot;email&quot;: &quot;62C12555-B37C-4163-9934-11BA9BC24F36@certain.com&quot;,&#xd;
&quot;ccAssistantOnEmails&quot;: false,&#xd;
&quot;ccAssociateOnEmails&quot;: false,&#xd;
&quot;accountCode&quot;: &quot;reeduat&quot;,&#xd;
&quot;profilePin&quot;: &quot;REEDUAT02433&quot;,&#xd;
&quot;pkProfileId&quot;: &quot;0x464940001&quot;,&#xd;
&quot;showOnline&quot;: true,&#xd;
&quot;imported&quot;: false,&#xd;
&quot;media&quot;: {&#xd;
&quot;url&quot;: &quot;&quot;,&#xd;
&quot;photo&quot;: null&#xd;
},&#xd;
&quot;privatePersonal&quot;: {&#xd;
&quot;dob&quot;: null,&#xd;
&quot;gender&quot;: null&#xd;
},&#xd;
&quot;notes&quot;: &quot;&quot;,&#xd;
&quot;address&quot;: {&#xd;
&quot;line1&quot;: &quot;Test addr line 1&quot;,&#xd;
&quot;line2&quot;: &quot;Test addr line 2&quot;,&#xd;
&quot;line3&quot;: &quot;Test addr line 3&quot;,&#xd;
&quot;line4&quot;: &quot;&quot;,&#xd;
&quot;city&quot;: &quot;Test addr city&quot;,&#xd;
&quot;state&quot;: &quot;GA&quot;,&#xd;
&quot;intlState&quot;: &quot;&quot;,&#xd;
&quot;countryCode&quot;: &quot;US&quot;,&#xd;
&quot;country&quot;: &quot;United States&quot;,&#xd;
&quot;postalCode&quot;: &quot;Test addr postal code&quot;&#xd;
}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">certainazure4.certain.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/certainExternal/service/v1/Profile/reeduat/REEDUAT02433</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Pro View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Pro Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pro POST Request 3" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value"> {&#xd;
&quot;profileId&quot;: 2434,&#xd;
&quot;dateCreated&quot;: &quot;2012-04-16T03:43:22&quot;,&#xd;
&quot;dateModified&quot;: &quot;2019-01-02T06:03:56&quot;,&#xd;
&quot;externalKey&quot;: &quot;&quot;,&#xd;
&quot;isActive&quot;: true,&#xd;
&quot;prefix&quot;: &quot;&quot;,&#xd;
&quot;suffix&quot;: &quot;&quot;,&#xd;
&quot;firstName&quot;: &quot;Test pro fname&quot;,&#xd;
&quot;middleName&quot;: &quot;&quot;,&#xd;
&quot;lastName&quot;: &quot;Test pro lname&quot;,&#xd;
&quot;badgeName&quot;: &quot;Test badge name&quot;,&#xd;
&quot;position&quot;: &quot;f&quot;,&#xd;
&quot;organization&quot;: &quot;f&quot;,&#xd;
&quot;phone&quot;: &quot;&quot;,&#xd;
&quot;phone2&quot;: &quot;&quot;,&#xd;
&quot;phoneMobile&quot;: &quot;&quot;,&#xd;
&quot;fax&quot;: &quot;&quot;,&#xd;
&quot;email&quot;: &quot;69E4D022-D598-4E63-8327-6F0361EC658E@certain.com&quot;,&#xd;
&quot;ccAssistantOnEmails&quot;: false,&#xd;
&quot;ccAssociateOnEmails&quot;: false,&#xd;
&quot;accountCode&quot;: &quot;reeduat&quot;,&#xd;
&quot;profilePin&quot;: &quot;REEDUAT02434&quot;,&#xd;
&quot;pkProfileId&quot;: &quot;0x465130001&quot;,&#xd;
&quot;showOnline&quot;: true,&#xd;
&quot;imported&quot;: false,&#xd;
&quot;media&quot;: {&#xd;
&quot;url&quot;: &quot;www.eibtm.com&quot;,&#xd;
&quot;photo&quot;: null&#xd;
},&#xd;
&quot;privatePersonal&quot;: {&#xd;
&quot;dob&quot;: null,&#xd;
&quot;gender&quot;: null&#xd;
},&#xd;
&quot;notes&quot;: &quot;&quot;,&#xd;
&quot;address&quot;: {&#xd;
&quot;line1&quot;: &quot;Test addr line 1&quot;,&#xd;
&quot;line2&quot;: &quot;Test addr line 2&quot;,&#xd;
&quot;line3&quot;: &quot;Test addr line 3&quot;,&#xd;
&quot;line4&quot;: &quot;&quot;,&#xd;
&quot;city&quot;: &quot;Test addr city&quot;,&#xd;
&quot;state&quot;: &quot;FL&quot;,&#xd;
&quot;intlState&quot;: &quot;&quot;,&#xd;
&quot;countryCode&quot;: &quot;US&quot;,&#xd;
&quot;country&quot;: &quot;United States&quot;,&#xd;
&quot;postalCode&quot;: &quot;Test addr postal code&quot;&#xd;
}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">certainazure4.certain.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/certainExternal/service/v1/Profile/reeduat/REEDUAT02434</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Pro View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Pro Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>